snappy_potential/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];    //[ X meter sec X X X X]

internalField   uniform (0 0 0.0001);    //inital condition 

boundaryField
{
    topPatch
    {
        type            zeroGradient;
    }

    wall
    {
        type            noSlip;
    }

    bottomPatch
    {
        type            fixedValue;
	value		uniform (0 0 0.0001);
    }
}

// ************************************************************************* //
